
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hawk0616/recruit-service-board-infla/actions/runs/6289954041)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
aws_ecr_repository.ecr_repository: Refreshing state... [id=recruit-service-board]
data.aws_ssm_parameter.rds_password: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06a74de91e584f523]
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ssm_get_parameter: Reading...
data.aws_iam_policy_document.ecs_task_assume: Reading...
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:113713103169:cluster/recruit-service-board]
aws_cloudwatch_log_group.cloudwatch_log_group: Refreshing state... [id=/aws/ecs/recruit-service-board]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
aws_iam_role.ecs_task: Refreshing state... [id=recruit-service-board-ecs-task]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ssm_get_parameter: Read complete after 0s [id=3537814278]
aws_iam_role.ecs: Refreshing state... [id=recruit-service-board-ecs]
aws_iam_policy.ssm_get_parameter: Refreshing state... [id=arn:aws:iam::113713103169:policy/recruit-service-board-ssm-get-parameter]
aws_iam_role_policy_attachment.ecs_task_ssm_get_parameter: Refreshing state... [id=recruit-service-board-ecs-task-20230922172051413600000001]
aws_iam_role_policy_attachment.ecs_basic: Refreshing state... [id=recruit-service-board-ecs-20230918174618982500000001]
data.aws_ssm_parameter.rds_password: Read complete after 1s [id=/recruit-service-board/rds/password]
aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=recruit-service-board]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=recruit-service-board]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0b4fa9cfb59fb8ed6]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-027284c710a0d8892]
aws_subnet.rds_subnet_a: Refreshing state... [id=subnet-0e7f8c94361b73d2f]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0ef372ea55e63234b]
aws_security_group.ecs: Refreshing state... [id=sg-01392c715b6f27337]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:targetgroup/recruit-service-board-tg/454711001d84759e]
aws_security_group.alb: Refreshing state... [id=sg-0ea3a71bbd61c86a8]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c5a36c42816c6a6e]
aws_subnet.rds_subnet_d: Refreshing state... [id=subnet-04400242864195eba]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e0e6b1c0c1ac041b]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09e72ede8507a7ede]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06b113e053f3b1456]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b66a8be9a7ddf00e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06d46b412cd4c9c97]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-045bc34d7c279cb27]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00f307d2ae25b4534]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09fbc8a2cc5227fc3]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-05212acebdfd26b46]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1730019703]
aws_security_group.rds: Refreshing state... [id=sg-01d224fac4c4d51f5]
aws_db_subnet_group.my_db_subnet_group: Refreshing state... [id=recruit-service-board-db-subnet-group]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-031bf5efc3f63faec]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0dd3ed9e6c5dcdb96]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:loadbalancer/app/recruit-service-board-alb/56d6da1d3ef15356]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00f307d2ae25b45341080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07700ba4124e8d2ab]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-088311edf380f4573]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0f95a65c3fedee2a9]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-00ecc0f91b532aa39]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09e72ede8507a7ede1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c5a36c42816c6a6e1080289494]
aws_db_instance.my_db_instance: Refreshing state... [id=db-KC5X2YWBBCAJQTD5C5W7HGNFKM]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener/app/recruit-service-board-alb/56d6da1d3ef15356/1eaa46f405a18931]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener-rule/app/recruit-service-board-alb/56d6da1d3ef15356/1eaa46f405a18931/1426ab8034eecf22]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:113713103169:service/recruit-service-board/recruit-service-board]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_instance_profile.bastion_profile will be created
  + resource "aws_iam_instance_profile" "bastion_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "recruit-service-board-bastion-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "recruit-service-board-bastion-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.bastion_role will be created
  + resource "aws_iam_role" "bastion_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "recruit-service-board-bastion-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_instance.bastion_host will be created
  + resource "aws_instance" "bastion_host" {
      + ami                                  = "ami-079cd5448deeace01"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "recruit-service-board-bastion-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "recruit-service-board-ec2-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-06d46b412cd4c9c97"
      + tags                                 = {
          + "Name" = "BastionHost"
        }
      + tags_all                             = {
          + "Name" = "BastionHost"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_security_group.bastion_sg will be created
  + resource "aws_security_group" "bastion_sg" {
      + arn                    = (known after apply)
      + description            = "Allow SSH traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "recruit-service-board-bastion"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "recruit-service-board-bastion"
        }
      + tags_all               = {
          + "Name" = "recruit-service-board-bastion"
        }
      + vpc_id                 = "vpc-06a74de91e584f523"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_iam_role.bastion_role: Creating...
aws_security_group.bastion_sg: Creating...
aws_iam_role.bastion_role: Creation complete after 0s [id=recruit-service-board-bastion-role]
aws_iam_instance_profile.bastion_profile: Creating...
aws_iam_instance_profile.bastion_profile: Creation complete after 0s [id=recruit-service-board-bastion-profile]
aws_security_group.bastion_sg: Creation complete after 5s [id=sg-0665a1d9386a3ab3a]
aws_instance.bastion_host: Creating...
aws_instance.bastion_host: Still creating... [10s elapsed]
aws_instance.bastion_host: Still creating... [20s elapsed]
aws_instance.bastion_host: Creation complete after 27s [id=i-08401505f601fc3c8]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":23,"Program":"tfcmt","SHA1":"7f42093dac574d0ac01788711e00cc8b769da742","Vars":{},"WorkflowName":"Terraform"} -->